{"players":[{"id":1,"name":"Sachin Tendulkar","description":"Tendulkar took up cricket at the age of eleven, made his Test debut on 15 November 1989 against Pakistan in Karachi at the age of sixteen, and went on to represent Mumbai domestically and India internationally for close to twenty-four years. He is the only player to have scored one hundred international centuries, the first batsman to score a double century in an ODI, the holder of the record for the most runs in both Test and ODI, and the only player to complete more than 30,000 runs in international cricket.","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/2/25/Sachin_Tendulkar_at_MRF_Promotion_Event.jpg"},{"id":2,"name":"Sourav Ganguly","description":"Ganguly was introduced into the world of cricket by his elder brother, Snehasish. He is regarded as one of India's most successful captains in modern times, and one of the greatest ODI batsmen of all time. He started his career by playing in state and school teams. Currently, he is the 8th highest run scorer in One Day Internationals (ODIs) and was the 3rd batsman in history to cross the 10,000 run landmark, after Sachin Tendulkar and Inzamam Ul Haq. In 2002, the Wisden Cricketers' Almanack ranked him the sixth greatest ODI batsman of all time, next to Viv Richards, Sachin Tendulkar, Brian Lara, Dean Jones and Michael Bevan.","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Sourav_Ganguly_closeup.jpg/520px-Sourav_Ganguly_closeup.jpg"},{"id":3,"name":"Kapil Dev","description":"Dev captained the Indian cricket team that won the 1983 Cricket World Cup. He was India's national cricket coach between October 1999 and August 2000. He retired in 1994, holding the world record for the greatest number of wickets taken in Test cricket, a record subsequently broken by Courtney Walsh in 2000","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Kapil_Dev_at_Equation_sports_auction.jpg/520px-Kapil_Dev_at_Equation_sports_auction.jpg"},{"id":4,"name":"MS Dhoni","description":"He made his ODI debut in December 2004 against Bangladesh, and played his first Test a year later against Sri Lanka. Dhoni has been the recipient of many awards, including the ICC ODI Player of the Year award in 2008 and 2009 (the first player to win the award twice), the Rajiv Gandhi Khel Ratna award in 2007, the Padma Shri, India's fourth highest civilian honour, in 2009 and the Padma Bhushan, India's third highest civilian honour, in 2018. He was named as the captain of the ICC World Test XI in 2009, 2010 and 2013. He has also been selected a record 8 times in ICC World ODI XI teams, 5 times as captain. The Indian Territorial Army conferred the honorary rank of Lieutenant Colonel[8] to Dhoni on 1 November 2011. He is the second Indian cricketer after Kapil Dev to receive this honour.","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/7/70/Mahendra_Singh_Dhoni_January_2016_%28cropped%29.jpg"},{"id":5,"name":"Virat Kohli","description":"Kohli was appointed the vice-captain of the ODI team in 2012 and handed over the Test captaincy following Mahendra Singh Dhoni's Test retirement in 2014. In early 2017, he became the limited-overs captain as well after Dhoni stepped down from the position. In ODIs, Kohli has the second highest number of centuries and the highest number of centuries in run-chases in the world. He holds the world record for being the fastest batsman to 10,000 and 11,000 runs in ODI cricket, reaching the milestones in 205 and 222 innings respectively","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Virat_Kohli_portrait.jpg/520px-Virat_Kohli_portrait.jpg"},{"id":6,"name":"Rahul Dravid","description":"As of December 2016, Dravid is the fourth-highest run scorer in Test cricket, after Sachin Tendulkar, Ricky Ponting and Jacques Kallis. In 2004, after completing his century against Bangladesh in Chittagong, he became the first and the only player till date to score a century in all the ten Test-playing countries. As of October 2012, he holds the record for the most catches taken by a player (non-wicket-keeper) in Test cricket, with 210.[14] Dravid holds a unique record of never getting out for a Golden duck in the 286 Test innings which he has played. He has faced 31258 balls, which is the highest number of balls faced by any player in test cricket. He has also spent 44152 minutes at the crease, which is the highest time spent on crease by any player in test cricket","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/1/1a/Rahul_Dravid_at_GQ_Men_Of_The_Year_2012_AWARD.jpg"},{"id":7,"name":"Rohit Sharma","description":"Rohit Gurunath Sharma (born 30 April 1987) is an Indian international cricketer who plays for Mumbai in domestic cricket and captains Mumbai Indians in the Indian Premier League as a right-handed batsman and an occasional right-arm off break bowler. He is the vice-captain of the Indian national team in limited-overs formats.Currently, he is regarded as one of the best batsman in the world.Outside cricket, Sharma is an active supporter of animal welfare campaigns. He is the official Rhino Ambassador for WWF-India and is a member of People for the Ethical Treatment of Animals (PETA). He has worked with PETA in its campaign to raise awareness of the plight of homeless cats and dogs in India","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/f/f7/Rohit_Sharma_November_2016_%28cropped%29.jpg"},{"id":8,"name":"K. L. Rahul","description":"Rahul was born on 18 April 1992 to K. N. Lokesh and Rajeshwari in Mangalore; his father Lokesh is a professor and former director at the National Institute of Technology Karnataka in the city and his mother Rajeshwari is a professor at Mangalore University. Lokesh, who was a fan of the cricketer Sunil Gavaskar, wanted to name his son after Gavaskar's, but mistook Rohan Gavaskar's name as Rahul.Rahul grew up in Mangalore and started playing cricket at the age of 11. At age 18 he moved to Bangalore to study at Jain University[4] and pursue his cricket career","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/6/69/KL_Rahul_at_Femina_Miss_India_2018_Grand_Finale_%28cropped%29.jpg"},{"id":9,"name":"Dinesh Karthik","description":"Dinesh Karthik (born 1 June 1985) is Indian wicket-keeper-batsman who made his debut for the Indian cricket team in 2004.Rising through the junior ranks, Karthik made his first-class debut in late-2002 for Tamil Nadu as a 17-year-old. He is the present captain of Kolkata Knight Riders replacing Gautam Gambhir.He played for India at the 2004 Under-19 World Cup and made his One Day International (ODI) and Test cricket debut in late 2004. Following India's elimination from the first round of the 2007 Cricket World Cup Karthik became a non-wicket-keeping opening batsman in the Test team and regularly played ODIs, batting in the middle order.","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Dinesh.Karthik.jpg/520px-Dinesh.Karthik.jpg"},{"id":10,"name":"Ravichandran Ashwin","description":"Having achieved little success as an opening batsman at junior-level cricket, Ashwin dropped down the order and turned into an off-break bowler. He made his first-class debut for Tamil Nadu in December 2006 and captained the team the following season. But it was not until the 2010 Indian Premier League in which he played for the Chennai Super Kings, that he came into the limelight with his economical bowling and earned his maiden international call-up in the limited-overs formats in June 2010. He was the leading wicket-taker and player of the tournament of the 2010 Champions League Twenty20 in South Africa. He was also part of the Indian squad that won the 2011 Cricket World Cup. Later that year, he made his Test debut against West Indies and became the seventh Indian to take a five-wicket haul on Test debut. He took two five-wicket hauls and scored a century in that series and won the player of the series award.","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/3/3c/Ravichandran_Ashwin_%28cropped%29.jpg"}]}
